Masmiseim36/nxpSDK/boards/mimxrt700evk/demo_apps/power_manager_test/bm/cm33_core0/hardware_init.c
    /* Initialze power/clock configuration. */
    BOARD_InitPowerConfig();

    /* Boot and wait CPU1 booted. */
    APP_BootCore1();

    /* After the CPU1 booted, CPU0 relinquish the domain's control over the modules, and give the other domain exclusive
     * control. */
    BOARD_PowerConfigAfterCPU1Booted();

    if ((POWER_GetEventFlags() & PMC_FLAGS_DEEPPDF_MASK) != 0)
    {
        PRINTF("Board wake up from deep or full deep power down mode.\r\n");
        POWER_ClearEventFlags(PMC_FLAGS_DEEPPDF_MASK);
    }
    POWER_ClearEventFlags(0xFFFFFFFF);
}

#if DEMO_POWER_USE_PLL
void BOARD_DisablePll(void)
{
    /* Disable the PFD clock output first. */
    CLOCK_DeinitMainPfd(kCLOCK_Pfd0);
    CLOCK_DeinitAudioPfd(kCLOCK_Pfd3);
    /* Disable PLL. */
    CLOCK_DeinitMainPll();
    CLOCK_DeinitAudioPll();
}

void BOARD_RestorePll(void)
{
    /*Restore PLL*/
    BOARD_BootClockRUN_InitClockModule(kClockModule_MAIN_PLL0);
    BOARD_BootClockRUN_InitClockModule(kClockModule_AUDIO_PLL0);
}
#endif

/*! @brief Decrease the CPU frequency and supply voltage for lower power consumption.
 * @return the origin mainclk divider.
 */
static inline uint32_t BOARD_PrepareForDS(void)
{
    uint32_t mainDiv = 0U;
#if DEMO_POWER_USE_PLL
    /*
     * Special sequence is needed for the PLL power up/initialization. The application should manually handle the states
     * changes for the PLL if the PLL power states configuration are different in Active mode and Deep Sleep mode. To
     * save power and to be simple, keep the PLL on only when Compute domain is active and sense domain will not use the
     * PLL.
     */
    /* Disable Pll before enter deep sleep mode */
    BOARD_DisablePll();
#endif
#if defined(DEMO_POWER_SUPPLY_OPTION) && (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
    /* Decrease CPU clock to decrease VDD2 supply in case sense is active. */
    mainDiv = (CLKCTL0->MAINCLKDIV & CLKCTL0_MAINCLKDIV_DIV_MASK) + 1U;

    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        CLOCK_SetClkDiv(kCLOCK_DivCmptMainClk, (SystemCoreClock + 31999999U) / 32000000U);
        BOARD_SetPmicVdd2Voltage(g_runVolt);
    }
#endif /* DEMO_POWER_SUPPLY_OPTION */

#if (defined(BOARD_PMIC_CONFIG_USE_SEMA4) && (BOARD_PMIC_CONFIG_USE_SEMA4 != 0U))
    CLOCK_DisableClock(kCLOCK_Sema420);
#endif
    CLOCK_DisableClock(kCLOCK_LPI2c15);

    /* Low power handshake to for async interrupt. */
    if (POWER_ModuleEnterLPRequest(APP_SW_LP_REQ) != kStatus_Success)
    {
        assert(false);
    }

    return mainDiv;
}

/*! @brief Decrease the CPU frequency and supply voltage for lower power consumption.
 * @param mainDiv the mainclk divider value.
 */
static inline void BOARD_RestoreAfterDS(uint32_t mainDiv)
{
#if (defined(BOARD_PMIC_CONFIG_USE_SEMA4) && (BOARD_PMIC_CONFIG_USE_SEMA4 != 0U))
    CLOCK_EnableClock(kCLOCK_Sema420);
#endif
    CLOCK_EnableClock(kCLOCK_LPI2c15);

#if defined(DEMO_POWER_SUPPLY_OPTION) && (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* Restore VDD2 supply and CPU clock. */
        BOARD_SetPmicVdd2Voltage(g_runVolt); /* Restore VDD2 supply. */
        CLOCK_SetClkDiv(kCLOCK_DivCmptMainClk, mainDiv);
    }

#endif /* DEMO_POWER_SUPPLY_OPTION */
#if DEMO_POWER_USE_PLL
    /* Restore Pll before enter deep sleep mode */
    BOARD_RestorePll();
#endif
}

void APP_PrepareForSleep(uint8_t powerState)
{
    switch (powerState)
    {
        case PM_LP_STATE_SLEEP:
        {
            break;
        }
        case PM_LP_STATE_DEEP_SLEEP:
        {
            mainDiv = BOARD_PrepareForDS();
            break;
        }
        case PM_LP_STATE_DSR:
        {
            mainDiv = BOARD_PrepareForDS();
            break;
        }
        case PM_LP_STATE_DEEP_POWER_DOWN:
        {
#if DEMO_POWER_USE_PLL
            BOARD_DisablePll();
#endif
#if (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
            BOARD_SetPmicVoltageBeforeDeepPowerDown();
#endif
            break;
        }
        case PM_LP_STATE_FULL_DEEP_POWER_DOWN:
        {
#if DEMO_POWER_USE_PLL
            BOARD_DisablePll();
#endif
#if (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
            BOARD_SetPmicVoltageBeforeDeepPowerDown();
#endif
            break;
        }
        default:
            /*No action need to be done. */
            break;
    }
}

void APP_RestoreAfterSleep(uint8_t powerState)
{
    switch (powerState)
    {
        case PM_LP_STATE_SLEEP:
        {
            break;
        }
        case PM_LP_STATE_DEEP_SLEEP:
        {
            BOARD_RestoreAfterDS(mainDiv);
            break;
        }
        case PM_LP_STATE_DSR:
        {
            BOARD_RestoreAfterDS(mainDiv);
            BOARD_RestorePeripheralsAfterDSR();
            break;
        }

        default:
            /*No action need to be done. */
            break;
    }
}

status_t APP_ControlCallback_notify(pm_event_type_t eventType, uint8_t powerState, void *data)
{
    if (eventType == kPM_EventEnteringSleep)
    {
        PRINTF("APP_ControlCallback ENTERING LP mode %d -- Notify.\r\n", powerState);
        APP_PrepareForSleep(powerState);
    }
    else
    {
        APP_RestoreAfterSleep(powerState);
        PRINTF("APP_ControlCallback EXITING LP mode %d -- Notify.\r\n", powerState);
    }

    return kStatus_Success;
}

void APP_SW_IRQ_HANDLER(void)
{
    POWER_ModuleExitLPRequest(APP_SW_LP_REQ); /* Clear the low power request before accessing the GPIO. */
    GPIO_GpioClearInterruptFlags(APP_USER_WAKEUP_KEY_GPIO, 1U << APP_USER_WAKEUP_KEY_PIN);
}

void APP_RTC_IRQ_HANDLER(void)
{
    uint32_t flags = IRTC_GetStatusFlags(APP_RTC);
    if (0U != flags)
    {
        /* Unlock to allow register write operation */
        IRTC_SetWriteProtection(APP_RTC, false);
        /*Clear all irtc flag */
        IRTC_ClearStatusFlags(APP_RTC, flags);
    }
}

void APP_StartTimer(uint64_t timeOutTickes)
{
    if (timeOutTickes != 0U)
    {
        IRTC_SetWriteProtection(APP_RTC, false);
        IRTC_ClearStatusFlags(APP_RTC, kIRTC_WakeTimerFlag);
        IRTC_EnableInterrupts(APP_RTC, kIRTC_WakeTimerInterruptEnable);
        IRTC_SetWakeupCount(APP_RTC, true, (timeOutTickes + 1023UL) / 1024UL);
    }
}

void APP_StopTimer(void)
{
    IRTC_SetWriteProtection(APP_RTC, false);
    IRTC_DisableInterrupts(APP_RTC, kIRTC_WakeTimerInterruptEnable);
}

